In [1]:
# import modules
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
%matplotlib inline

In [2]:
data1 = Series([6, 77, 888, 9999])

In [4]:
data1

0       6
1      77
2     888
3    9999
dtype: int64

In [5]:
data1.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [6]:
data2 = Series([8, 9, 11], index = ['Joe', 'Jane', 'John'])

In [8]:
data2

Joe      8
Jane     9
John    11
dtype: int64

In [7]:
data2['Joe']

8

In [8]:
data3 = Series([9, 10, 11], index = ['Joe', 'Joe', 'John'])

In [12]:
data3

Joe      9
Joe     10
John    11
dtype: int64

In [9]:
data3['Joe']

Joe     9
Joe    10
dtype: int64

In [11]:
data2[['Joe', 'John']]

Joe      8
John    11
dtype: int64

In [12]:
data3[['Joe', 'John']]

Joe      9
Joe     10
John    11
dtype: int64

In [13]:
data2 += 1

In [14]:
data2

Joe      9
Jane    10
John    12
dtype: int64

In [15]:
data2[data2 > 10]

John    12
dtype: int64

In [16]:
data4 = Series(np.random.rand(20))

In [27]:
data4[data4 <= 0.75]

0     0.036402
1     0.620515
3     0.176861
4     0.533308
5     0.186512
6     0.670761
7     0.418969
8     0.676844
10    0.212033
11    0.315341
14    0.270953
15    0.498167
16    0.574236
18    0.732956
19    0.315091
dtype: float64

In [28]:
data = {'school': ['Baxters', 'Racine'], 'test scores': [90, 96]}

In [30]:
table = DataFrame(data, index = ['School 1', 'School 2'])

In [31]:
table

           school  test scores
School 1  Baxters           90
School 2   Racine           96

In [32]:
data = {'name' : ['James', 'Jane', 'John', 'Jake', 'Audrey'], 
        'sex' : ['M', 'F', 'M', 'M', 'F']}

In [34]:
table = DataFrame(data)

In [35]:
table

     name sex
0   James   M
1    Jane   F
2    John   M
3    Jake   M
4  Audrey   F

In [36]:
data = {'name' : ['James', 'Jane', 'John', 'Jake','Audrey'],
    'sex' : ['M', 'F', 'M', 'M', 'F'], 
    'age':[16,17,18,20,15], 
    'height':[77, 56, 66, 61, 50]}

In [37]:
data

{'age': [16, 17, 18, 20, 15],
 'height': [77, 56, 66, 61, 50],
 'name': ['James', 'Jane', 'John', 'Jake', 'Audrey'],
 'sex': ['M', 'F', 'M', 'M', 'F']}

In [38]:
table = DataFrame(data, columns = ['name', 'age', 'sex', 'height'])

In [39]:
table

     name  age sex  height
0   James   16   M      77
1    Jane   17   F      56
2    John   18   M      66
3    Jake   20   M      61
4  Audrey   15   F      50

In [42]:
table['name']

0     James
1      Jane
2      John
3      Jake
4    Audrey
Name: name, dtype: object

In [43]:
table[['name', 'age']]

     name  age
0   James   16
1    Jane   17
2    John   18
3    Jake   20
4  Audrey   15

In [44]:
table.mean()

age       17.2
height    62.0
dtype: float64

In [45]:
table['height'].mean()

62.0